import 'package:flutter/material.dart';
import 'package:get/get.dart';

class HomeController extends GetxController {
  /* var typeselected = GoogleFonts.alexandria;
  int changetype = 0;
  changeTypeFonts() {
    typeselected = listTypeFonts[changetype];
    update();
  }

  var listTypeFonts = [
    GoogleFonts.alexandria,
    GoogleFonts.readexPro,
    GoogleFonts.cairo,
    GoogleFonts.ibmPlexSansArabic,
    GoogleFonts.almarai,
  ];*/
  var listallLow = [
    ['نظام المزايدات والمناقصات الخاصة بالاوقاف\nالعراقية رقم 45 لسنة'],
    ['نظام المزايدات والمناقصات الخاصة بالاوقاف\nالعراقية رقم 45 لسنة'],
    ['نظام المزايدات والمناقصات الخاصة بالاوقاف\nالعراقية رقم 45 لسنة'],
    ['نظام المزايدات والمناقصات الخاصة بالاوقاف\nالعراقية رقم 45 لسنة'],
  ];
  //servicessPage And
  var list1 = [
    ['بوابة موقع\nوزارة العدل', 'asset/two/rights-icon.png', true, true],
    ['قرارات التمييز', 'asset/two/regulations-icon.png', true, true],
    [
      'قرارات رئاسة\nمجلس الوزراء',
      'asset/two/seminar-speech-icon.png',
      true,
      true,
    ],
    ['البنك المركزي', 'asset/two/bank-finance-loan-icon.png', true, true],
    [
      'أوامر سلطة\nالأئتلاف المؤقتة',
      'asset/two/law-legal-icon.png',
      true,
      true
    ],
    ['جريدة الوقائع\nالعراقية', 'asset/two/newspaper-icon.png', true, true],
    ['بوابة القضاء\nالألكترونية', 'asset/three/scale-icon.png', true, true],
    ['', '', true, null],
    ['', '', true, false],
  ];
  String? valueOfSearch1;
  changeValueOfScrech(value) {
    valueOfSearch1 = value;
    update();
  }

  // moreLowsPage
  var listmoreLowsPage = [
    [
      'المادة ( 1 )',
      '''يعمل الديوان على تحقيق الاهداف الاتية :-
              اولا" :- توثيق الروابط الدينية مع العالم الاسلامي بوجه خاص والعالم بوجـه عام .
              ثانيا":- تنظيم شؤون ادارة الاوقاف والاشراف عليها ومراقبتها وفق الاوجه الشرعية .
              ثالثا":- استثمار اموال الاوقاف في الاوجه الشرعية بما يضمن الحفاظ عليها وتنميتها .
              رابعا":- العناية بتنفيذ شروط الواقفين والاشراف على الاوقاف الملحقه .
              خامسا":- العناية بشؤون المؤسسات السنية الدينية والخيرية ومراقد الاولياء والصحابة والصالحين ومقاماتهم .
              سادسا":- تعزيز وتنمية الثقافة الاسلامية واحياء التراث الاسلامي والاثار الاسلامية والمحافظة عليها .
              سابعاً :- التقريب بين المذاهب.''',
      false,
      "1"
    ],
    [
      'المادة ( 2 )',
      '''يعمل الديوان على تحقيق الاهداف الاتية :-
              اولا" :- توثيق الروابط الدينية مع العالم الاسلامي بوجه خاص والعالم بوجـه عام .
              ثانيا":- تنظيم شؤون ادارة الاوقاف والاشراف عليها ومراقبتها وفق الاوجه الشرعية .
              ثالثا":- استثمار اموال الاوقاف في الاوجه الشرعية بما يضمن الحفاظ عليها وتنميتها .
              رابعا":- العناية بتنفيذ شروط الواقفين والاشراف على الاوقاف الملحقه .
              خامسا":- العناية بشؤون المؤسسات السنية الدينية والخيرية ومراقد الاولياء والصحابة والصالحين ومقاماتهم .
              سادسا":- تعزيز وتنمية الثقافة الاسلامية واحياء التراث الاسلامي والاثار الاسلامية والمحافظة عليها .
              سابعاً :- التقريب بين المذاهب.''',
      true,
      '2'
    ],
    [
      'المادة ( 3 )',
      '''يعمل الديوان على تحقيق الاهداف الاتية :-
              اولا" :- توثيق الروابط الدينية مع العالم الاسلامي بوجه خاص والعالم بوجـه عام .
              ثانيا":- تنظيم شؤون ادارة الاوقاف والاشراف عليها ومراقبتها وفق الاوجه الشرعية .
              ثالثا":- استثمار اموال الاوقاف في الاوجه الشرعية بما يضمن الحفاظ عليها وتنميتها .
              رابعا":- العناية بتنفيذ شروط الواقفين''',
      true,
      '3'
    ],
    [
      'المادة ( 4 )',
      '''يعمل الديوان على تحقيق الاهداف الاتية :-
              اولا" :- توثيق الروابط الدينية مع العالم الاسلامي بوجه خاص والعالم بوجـه عام .
              ثانيا":- تنظيم شؤون ادارة الاوقاف والاشراف عليها ومراقبتها وفق الاوجه الشرعية .
              ثالثا":- استثمار اموال الاوقاف في الاوجه الشرعية بما يضمن الحفاظ عليها وتنميتها .
              رابعا":- العناية بتنفيذ شروط الواقفين والاشراف على الاوقاف الملحقه .
              خامسا":- العناية بشؤون المؤسسات السنية الدينية والخيرية ومراقد الاولياء والصحابة والصالحين ومقاماتهم .
              سادسا":- تعزيز وتنمية الثقافة الاسلامية واحياء التراث الاسلامي والاثار الاسلامية والمحافظة عليها .
              سابعاً :- التقريب بين المذاهب.''',
      true,
      '4'
    ],
    [
      'المادة ( 5 )',
      '''يعمل الديوان على تحقيق الاهداف الاتية :-
              اولا" :- توثيق الروابط الدينية مع العالم الاسلامي بوجه خاص والعالم بوجـه عام .
              ثانيا":- تنظيم شؤون ادارة الاوقاف والاشراف عليها ومراقبتها وفق الاوجه الشرعية .
              ثالثا":- استثمار اموال الاوقاف في الاوجه الشرعية بما يضمن الحفاظ عليها وتنميتها .
              رابعا":- العناية بتنفيذ شروط الواقفين''',
      true,
      '5'
    ],
  ];
  var list2 = [
    ['النفقة', 'asset/three/women-empowerment-icon.png'],
    ['الطلاق', 'asset/three/law-icon.png'],
    ['الحضانة', 'asset/three/baby-icon.png'],
    ['الزواج', 'asset/three/man-woman-icon.png'],
    ['اثبات النسب', 'asset/three/miscommunication-icon.png'],
    [
      'التفريق القضائي',
      'asset/balance-1-svgrepo-com (1).png',
    ],
    [
      'الوصية',
      'asset/three/regulation-icon.png',
    ],
    [
      'التحرش الجنسي',
      'asset/three/man-woman-symbol-icon.png',
    ],
    [
      'زواج القاصر',
      'asset/three/bride-icon.png',
    ],
    [
      'المهر',
      'asset/three/penalty-icon.png',
    ],
    [
      'السرقة',
      'asset/three/hand-money-dollar-coin-icon.png',
    ],
    [
      'الخيانة',
      'asset/three/broken-heart-icon.png',
    ],
  ];
  String? valueOfSearchLowPage;
  changeValueOfScrechLowPage(value) {
    valueOfSearchLowPage = value;
    update();
  }

  //allnews
  var list = [
    [
      ' توثيق الروابط الدينية مع العالم الاسلامي بوجه',
      'أصدرت محكمة جنايات النجف الأشرف اليوم الأربعاء حكماً بالإعدام ضد مدان قام بذبح طفل في سوق شعبي وأوضحت السلطات القضائية في بيان نقلته مواقع دليل القوانين العراقية أن المتهم اشترى سكينًا واستخدمها لقتل الطفل البالغ من العمر ثلاثة عشر عامًا، حيث قام بفصل رأسه عن جسده أمام حشد من الناس في سوق حي الأنصار بمدينة النجف الأشرف. المحكمة وجدت الأدلة المتاحة كافية ومقنعة لإدانته وفقًا لأحكام المادة 406/1/ج من قانون العقوبات.',
      'asset/enlarge_Rectangle_698.png',
      () {}
    ],
    [
      ' المتولين العراقي رقم 46 لسنة 1970 متولي الوقف',
      'أصدرت محكمة جنايات النجف الأشرف اليوم الأربعاء حكماً بالإعدام ضد مدان قام بذبح طفل في سوق شعبي وأوضحت السلطات القضائية في بيان نقلته مواقع دليل القوانين العراقية أن المتهم اشترى سكينًا واستخدمها لقتل الطفل البالغ من العمر ثلاثة عشر عامًا، حيث قام بفصل رأسه عن جسده أمام حشد من الناس في سوق حي الأنصار بمدينة النجف الأشرف. المحكمة وجدت الأدلة المتاحة كافية ومقنعة لإدانته وفقًا لأحكام المادة 406/1/ج من قانون العقوبات.',
      'asset/enlarge_Rectangle_698.png',
      () {}
    ],
    [
      'نظام المتولين العراقي رقم 46 لسنة 1970 متولي الوقف',
      'أصدرت محكمة جنايات النجف الأشرف اليوم الأربعاء حكماً بالإعدام ضد مدان قام بذبح طفل في سوق شعبي وأوضحت السلطات القضائية في بيان نقلته مواقع دليل القوانين العراقية أن المتهم اشترى سكينًا واستخدمها لقتل الطفل البالغ من العمر ثلاثة عشر عامًا، حيث قام بفصل رأسه عن جسده أمام حشد من الناس في سوق حي الأنصار بمدينة النجف الأشرف. المحكمة وجدت الأدلة المتاحة كافية ومقنعة لإدانته وفقًا لأحكام المادة 406/1/ج من قانون العقوبات.',
      'asset/enlarge_Rectangle_698.png',
      () {}
    ],
    [
      'نظام المتولين العراقي رقم 46 لسنة 1970 متولي الوقف',
      'أصدرت محكمة جنايات النجف الأشرف اليوم الأربعاء حكماً بالإعدام ضد مدان قام بذبح طفل في سوق شعبي وأوضحت السلطات القضائية في بيان نقلته مواقع دليل القوانين العراقية أن المتهم اشترى سكينًا واستخدمها لقتل الطفل البالغ من العمر ثلاثة عشر عامًا، حيث قام بفصل رأسه عن جسده أمام حشد من الناس في سوق حي الأنصار بمدينة النجف الأشرف. المحكمة وجدت الأدلة المتاحة كافية ومقنعة لإدانته وفقًا لأحكام المادة 406/1/ج من قانون العقوبات.',
      'asset/enlarge_Rectangle_698.png',
      () {}
    ],
    [
      'نظام المتولين العراقي رقم 46 لسنة 1970 متولي الوقف',
      'أصدرت محكمة جنايات النجف الأشرف اليوم الأربعاء حكماً بالإعدام ضد مدان قام بذبح طفل في سوق شعبي وأوضحت السلطات القضائية في بيان نقلته مواقع دليل القوانين العراقية أن المتهم اشترى سكينًا واستخدمها لقتل الطفل البالغ من العمر ثلاثة عشر عامًا، حيث قام بفصل رأسه عن جسده أمام حشد من الناس في سوق حي الأنصار بمدينة النجف الأشرف. المحكمة وجدت الأدلة المتاحة كافية ومقنعة لإدانته وفقًا لأحكام المادة 406/1/ج من قانون العقوبات.',
      'asset/enlarge_Rectangle_698.png',
      () {}
    ],
  ];
  List listright = [
    [
      'هل خروج الزوجة من بيت الزوجية بدون عذر يحرمها من المطالبة بالنفقة المستمرة ؟',
      'لا, خروجها لا يحرمها',
    ],
    [
      'هل خروج الزوجة من بيت الزوجية بدون عذر يحرمها من المطالبة بالنفقة المستمرة ؟',
      'لا, خروجها لا يحرمها'
    ],
    [
      'هل خروج الزوجة من بيت الزوجية بدون عذر يحرمها من المطالبة بالنفقة المستمرة ؟',
      'لا, خروجها لا يحرمها'
    ],
  ];
  List listservess = [
    'هل خروج الزوجة من بيت الزوجية بدون عذر يحرمها من المطالبة بالنفقة المستمرة ؟',
    'لا, خروجها لا يحرمها'
  ];
  var screenindex = 6;
  changescreen(index) {
    screenindex = index;
    update();
  }

  bool hover = false;
  changehover() {
    hover = false;
    update();
  }
}
